/*
 Localizable.strings
 CSResourceFork
 
 Created by Charles Srstka on 2/19/12.
 Copyright (c) 2012 __MyCompanyName__. All rights reserved.
 */

"Yes" = "是";
"No" = "否";

"Error" = "错误";
"Warning" = "警告";

"NOT_RSRC_FILE" = "文件 “%@” 不是一个资源文件。";
"UNKNOWN_ERROR" = "未知错误";

"FORK_READ_ERROR" = "从该资源分支读取数据出错：%d";
"FORK_WRITE_ERROR" = "写入数据到该资源分支时出错：%d";

"NOT_A_READ_HANDLE" = "此文件句柄不能读取数据。";
"NOT_A_WRITE_HANDLE" = "此文件句柄不能写入数据。";

"RES_TOO_LARGE" = "‘%@’ ID %d 的大小是 %lu 字节，但资源的大小不能超过 %lu 字节。";
"RES_DATA_TOO_LARGE" = "此资源文件中的资源总大小超过了 %lu 字节，是不允许的。";

"TOO_MANY_TYPES" = "一个资源文件不能包含超过 %lu 个资源类型。";

"TYPE_LIST_OFFSET_TOO_LARGE" = "资源类型列表偏移为 %lu，但最大值为 %lu。";
"NAME_LIST_OFFSET_TOO_LARGE" = "资源名称列表偏移为 %lu，但最大值为 %lu。";
"RES_NAME_OFFSET_TOO_LARGE" = "资源 ‘%@’ ID %d 的名称偏移过长；最大值是 %lu。";
"RES_DATA_OFFSET_TOO_LARGE" = "‘%@’ ID %d 的资源数据偏移过长；最大值是 %lu。";
"REF_LIST_TOO_LONG" = "类型 ‘%@’ 的参考列表过长；它必须小于 %lu 字节。";
"TOO_MANY_RESOURCES" = "类型 ‘%@’ 的资源过多；最大值是 %lu。";

"INVALID_RESOURCE_TYPE" = "无效资源类型 ‘%@’。";
"INVALID_RESOURCE_ID" = "无效资源 id %ld；仅从 %d 到 %d 的值是允许的。";

"RES_DATA_NOT_FOUND" = "无法找到 ‘%@’ ID %d 的资源数据。";

"RES_ALREADY_EXISTS" = "已存在类型 ‘%@’ 和 ID %d 的资源。";
"RES_NOT_FOUND" = "资源类型 ‘%@’ %d 未找到。";

"FORK_ALREADY_EXISTS" = "指定分支已存在。";
"FORK_NOT_FOUND" = "指定分支不存在。";

"XATTR_NOT_FOUND" = "扩展属性 “%@” 似乎不存在。";
"XATTR_ALREADY_EXISTS" = "名为 “%@” 的扩展属性已经存在。";

"INVALID_HFS_TYPE" = "无效类型 “%@”。";
"INVALID_CREATOR" = "无效创建者 “%@”。";

"DATA_FORK_NOT_SUPPORTED" = "文件 “%@” 不支持数据分支。";
"RSRC_FORK_NOT_SUPPORTED" = "文件 “%@” 不支持资源分支。";
"XATTRS_NOT_SUPPORTED" = "文件 “%@” 不支持扩展属性。";
"SPECIAL_XATTR_NOT_SUPPORTED" = "抱歉，不支持特殊扩展属性 “%@”。";
"SPECIAL_XATTR_CANNOT_BE_RENAMED" = "抱歉，不能重命名特殊扩展属性 “%@”。";

"UID_NOT_FOUND" = "没有用户以 ID %lu 存在。";
"USER_NAME_NOT_FOUND" = "没有用户以名称 “%@” 存在。";

"GID_NOT_FOUND" = "没有组别以 ID %lu 存在。";
"GROUP_NAME_NOT_FOUND" = "没有组别以名称 “%@” 存在。";

// ACL stuff

"User" = "user";
"Group" = "uroup";
"Unknown" = "unknown";

"allow" = "allow";
"deny" = "deny";

"ACL_READ_DATA" = "read";
"ACL_LIST_DIRECTORY" = "list";
"ACL_WRITE_DATA" = "write";
"ACL_ADD_FILE" = "add_file";
"ACL_EXECUTE" = "execute";
"ACL_SEARCH" = "search";
"ACL_DELETE" = "delete";
"ACL_APPEND_DATA" = "append";
"ACL_ADD_SUBDIRECTORY" = "add_subdirectory";
"ACL_DELETE_CHILD" = "delete_child";
"ACL_READ_ATTRIBUTES" = "readattr";
"ACL_WRITE_ATTRIBUTES" = "writeattr";
"ACL_READ_EXTATTRIBUTES" = "readextattr";
"ACL_WRITE_EXTATTRIBUTES" = "writeextattr";
"ACL_READ_SECURITY" = "readsecurity";
"ACL_WRITE_SECURITY" = "writesecurity";
"ACL_CHANGE_OWNER" = "chown";

"ACL_FILE_INHERIT" = "file_inherit";
"ACL_DIRECTORY_INHERIT" = "directory_inherit";
"ACL_LIMIT_INHERIT" = "limit_inherit";
"ACL_ONLY_INHERIT" = "only_inherit";

"ACL_PERM_SEPARATOR" = ", ";
